# Practice Questins -> SQL

In [1]:
import pandas as pd

In [24]:
df = pd.DataFrame({
    'rollno': [101, 102, 103, 104, 105, 106],
    'name': ['Anil','Bhumika', 'Chetan', 'Dhruv', 'Emaanuel', 'Farah'],
    'marks': [78, 93, 85, 96, 12, 82],
    'grade': ['C','A', 'B', 'A', 'F', 'B'],
    'city': ['Pune', 'Mumbai', 'Mumbai', 'Delhi', 'Delhi', 'Delhi']
},
index=[1,2,3,4,5,6]
)

df

   rollno      name  marks grade    city
1     101      Anil     78     C    Pune
2     102   Bhumika     93     A  Mumbai
3     103    Chetan     85     B  Mumbai
4     104     Dhruv     96     A   Delhi
5     105  Emaanuel     12     F   Delhi
6     106     Farah     82     B   Delhi

In [25]:
# group by city
df.groupby('city').agg({
    'city': ['count']
})

        city
       count
city
Delhi      3
Mumbai     2
Pune       1

In [26]:
# select students whose marks greater than 80
df[df['marks'] > 80]

   rollno     name  marks grade    city
2     102  Bhumika     93     A  Mumbai
3     103   Chetan     85     B  Mumbai
4     104    Dhruv     96     A   Delhi
6     106    Farah     82     B   Delhi

In [21]:
# select students where marks greater than 80 and city is mumbai

df[(df['marks'] > 80) & (df['city'] == 'Mumbai')]

   rollno     name  marks grade    city
2     102  Bhumika     93     A  Mumbai
3     103   Chetan     85     B  Mumbai

In [27]:
# select students where marks greater than 80 or city is mumbai

df[(df['marks'] > 80) | (df['city'] == 'Mumbai')]

   rollno     name  marks grade    city
2     102  Bhumika     93     A  Mumbai
3     103   Chetan     85     B  Mumbai
4     104    Dhruv     96     A   Delhi
6     106    Farah     82     B   Delhi

In [30]:
# select students whose makrs lies in between 80 and 90

df[(df['marks'] >= 80) & (df['marks'] <= 90)]

   rollno    name  marks grade    city
3     103  Chetan     85     B  Mumbai
6     106   Farah     82     B   Delhi

In [32]:
# selects students of 'Delhi' and 'Mumbai'

df[df['city'].isin(['Delhi', 'Mumbai'])]

   rollno      name  marks grade    city
2     102   Bhumika     93     A  Mumbai
3     103    Chetan     85     B  Mumbai
4     104     Dhruv     96     A   Delhi
5     105  Emaanuel     12     F   Delhi
6     106     Farah     82     B   Delhi